app/controllers/api/pokemon_controller.rb

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = $1  [["pokemon_id", 5]]
---
  def show

    @pokemon = Pokemon.find(params[:id])
    @items = Item.find_by(pokemon_id: @pokemon.id)